20260209075612-durg_bhandar_2026_02_07_sat.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-03-29 Sun 12:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Durg bhandar &lt;2026-02-07 Sat&gt;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Durg bhandar <span class="timestamp-wrapper"><span class="timestamp">&lt;2026-02-07 Sat&gt;</span></span></h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb139e8f">Trek Overview</a></li>
<li><a href="#org61dcd18">Schedule &amp; Companions</a></li>
<li><a href="#org94ba7f6">Route Information</a></li>
<li><a href="#org7fd3385">Historical / Mythological Background</a></li>
<li><a href="#orgd8fef6e">Key Landmarks &amp; Attractions</a></li>
<li><a href="#orgeabda37">Experience &amp; Observations</a></li>
<li><a href="#orgeac74e9">Facilities &amp; Amenities</a></li>
<li><a href="#org6158a93">Local Notes</a></li>
<li><a href="#org979129f">Photos &amp; Media</a></li>
<li><a href="#org1da00bf">Reflection</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb139e8f" class="outline-2">
<h2 id="orgb139e8f">Trek Overview</h2>
<div class="outline-text-2" id="text-orgb139e8f">
<ol class="org-ol">
<li>Trek Name: Durg Bhandar</li>
<li>Region: Trimbakeshwar</li>
<li>Range: Trimbakeshwar range</li>
<li>Base Village: Trimbak</li>
<li>Height from MSL (ft): 4050 ft</li>
<li>Type:
<ul class="org-ul">
<li class="on"><code>[X]</code> hill fort</li>
<li class="off"><code>[&#xa0;]</code> forest trail</li>
<li class="off"><code>[&#xa0;]</code> plateau</li>
</ul></li>
<li>Difficulty Level:
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> easy</li>
<li class="on"><code>[X]</code> moderate</li>
<li class="off"><code>[&#xa0;]</code> difficult</li>
</ul></li>
<li>Best Season:
<ul class="org-ul">
<li class="on"><code>[X]</code> winter</li>
<li class="off"><code>[&#xa0;]</code> summer</li>
<li class="off"><code>[&#xa0;]</code> monsoon</li>
</ul></li>
<li>Time taken to Climb [hrs]:  2.5</li>
<li>Water Availability: availability at bramhgiri
<ul class="org-ul">
<li class="on"><code>[X]</code> yes</li>
<li class="off"><code>[&#xa0;]</code> no</li>
</ul></li>
<li>Suitable For:
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> beginners</li>
<li class="on"><code>[X]</code> regular trekkers</li>
<li class="off"><code>[&#xa0;]</code> families</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org61dcd18" class="outline-2">
<h2 id="org61dcd18">Schedule &amp; Companions</h2>
<div class="outline-text-2" id="text-org61dcd18">
<ol class="org-ol">
<li>Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2026-02-07 Sat&gt;</span></span></li>
<li>Team Members: 15 members.</li>
<li>Wake-up Time:  <span class="timestamp-wrapper"><span class="timestamp">&lt;2026-02-07 Sat 05:00&gt;</span></span></li>
<li>Left Home: <span class="timestamp-wrapper"><span class="timestamp">&lt;2026-02-07 Sat 06:10&gt;</span></span></li>
<li>Start Point / Meeting Place: ABB circle</li>
<li>Route Start Time:  <span class="timestamp-wrapper"><span class="timestamp">&lt;2026-02-07 Sat 07:12&gt;</span></span></li>
<li>Return Time: <span class="timestamp-wrapper"><span class="timestamp">&lt;2026-02-07 Sat 02:00&gt;</span></span></li>
<li>Key Stops / Temples / Checkpoints: 
<ul class="org-ul">
<li>Jata mandir</li>
<li>bramhgiri mandir</li>
<li>ganga dwar</li>
<li>shankar mandir</li>
<li>view of talegaon dam</li>
<li>view of harihar fort.</li>
<li>Dharmshala</li>
<li>vihir at the backside of the Dharmshala.</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org94ba7f6" class="outline-2">
<h2 id="org94ba7f6">Route Information</h2>
<div class="outline-text-2" id="text-org94ba7f6">
<ol class="org-ol">
<li>Route from Nashik City: ABB circle -&gt; pegalwadi -&gt; swami samarth kaman -&gt; base of the trek</li>
<li>Final Village Distance km: 24</li>
<li>Public Transport Availability: bus</li>
<li>Parking / Auto / Petrol: trimbakeshwar.</li>
</ol>
</div>
</div>

<div id="outline-container-org7fd3385" class="outline-2">
<h2 id="org7fd3385">Historical / Mythological Background</h2>
<div class="outline-text-2" id="text-org7fd3385">
<ol class="org-ol">
<li>Historical Importance:
<ul class="org-ul">
<li></li>
</ul></li>
<li>Legends / Myths:
<ul class="org-ul">
<li></li>
</ul></li>
<li>Nearby Heritage / Religious Sites:
<ul class="org-ul">
<li></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgd8fef6e" class="outline-2">
<h2 id="orgd8fef6e">Key Landmarks &amp; Attractions</h2>
<div class="outline-text-2" id="text-orgd8fef6e">
<ol class="org-ol">
<li>Temples:
<ul class="org-ul">
<li></li>
</ul></li>
<li>Structures (Bastions, Caves, Gates, etc.):
<ul class="org-ul">
<li></li>
</ul></li>
<li>Viewpoints (Ranges / Dams visible):
<ul class="org-ul">
<li></li>
</ul></li>
<li>Not to Miss:
<ul class="org-ul">
<li></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgeabda37" class="outline-2">
<h2 id="orgeabda37">Experience &amp; Observations</h2>
<div class="outline-text-2" id="text-orgeabda37">
<ol class="org-ol">
<li>Weather / Terrain:</li>
<li>Notable Sights:</li>
<li>Personal Experience:</li>
<li>Vibe / Mood of Place:</li>
<li>Tips for Future Trekkers:</li>
</ol>
</div>
</div>

<div id="outline-container-orgeac74e9" class="outline-2">
<h2 id="orgeac74e9">Facilities &amp; Amenities</h2>
<div class="outline-text-2" id="text-orgeac74e9">
<ol class="org-ol">
<li>Food / Water Availability:</li>
<li>Accommodation / Prasadam Timings:</li>
<li>Shops / Auto Repair / Petrol Info:</li>
<li>Guide Needed:</li>
<li class="off"><code>[&#xa0;]</code> yes</li>
<li class="off"><code>[&#xa0;]</code> no</li>
</ol>
</div>
</div>

<div id="outline-container-org6158a93" class="outline-2">
<h2 id="org6158a93">Local Notes</h2>
<div class="outline-text-2" id="text-org6158a93">
<ol class="org-ol">
<li>Village Population / Details:</li>
<li>Major FoodCrops:</li>
<li>Local Culture / People:</li>
</ol>
</div>
</div>

<div id="outline-container-org979129f" class="outline-2">
<h2 id="org979129f">Photos &amp; Media</h2>
<div class="outline-text-2" id="text-org979129f">
<ol class="org-ol">
<li class="off"><code>[&#xa0;]</code> Add photos</li>
<li class="off"><code>[&#xa0;]</code> Add route map (GPS screenshot)</li>
<li class="off"><code>[&#xa0;]</code> Add group photo</li>
</ol>
</div>
</div>

<div id="outline-container-org1da00bf" class="outline-2">
<h2 id="org1da00bf">Reflection</h2>
<div class="outline-text-2" id="text-org1da00bf">
<ol class="org-ol">
<li>What I Loved Most:</li>
<li>What I’d Improve Next Time:</li>
<li>Recommend To:</li>
<li>Return Visit:</li>
<li class="off"><code>[&#xa0;]</code> yes/no</li>
<li class="off"><code>[&#xa0;]</code> (why?)</li>
</ol>
</div>
</div>
</div>
</body>
</html>